from google import crawler

stocks1 = ['台泥','亞泥','統一','台塑','南亞','台化','遠東新','中鋼','正新','和泰車']
stocks2 = ['光寶科','聯電','台達電','鴻海','國巨','台積電','華碩','廣達','研華','南亞科']
stocks3 = ['友達','中華電','聯發科','可成','台灣高鐵','彰銀','中壽','華南金','富邦金','國泰金']
stocks4 = ['開發金','玉山金','元大金','兆豐金','台新金','永豐金','中信金','第一金','統一超','大立光']
stocks5 = ['台灣大','群創','日月光投控','遠傳','和碩','中租-KY','上海商銀','合庫金','台塑化','寶成']

start_date = ['1/1/2019','2/1/2019','3/1/2019']
end_date = ['1/31/2019','2/28/2019','3/31/2019']

stock = stocks4 + stocks5
for item in stock:
	for i in range(3):
		crawler(item,start_date[i],end_date[i],str(i+1))

# crawler('聯電',start_date[1],end_date[1],"2")
